Revit 2024 API
StructuralSectionRectangular.CentroidHorizontal Property
 Distance from centroid to the left extremites along horizontal axis.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double CentroidHorizontal { get; set; }
Visual Basic
Public Property CentroidHorizontal As Double
	Get
	Set
Visual C++
public:
property double CentroidHorizontal {
	double get ();
	void set (double value);
}
See Also
StructuralSectionRectangular Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace